run/muck_q2d_FFT/0/B
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      B;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -2 0 0 -1 0];

internalField   uniform 0;  //0.0037070;  

boundaryField
{
    xinlet
    {
        type            zeroGradient;
    }
    xoutlet
    {
        type            zeroGradient;
    }
    sideWalls
    {
        type            zeroGradient;
    }
    hartmannWalls
    {
        type            empty;
    }
    cylinder
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
