run/muck_q2d_FFT/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    xoutlet
    {
        type            zeroGradient;
    }
    xinlet
    {
        type            fixedValue;
        value       	uniform 0;
    }
    sideWalls
    {
        type            zeroGradient;
    }
    hartmannWalls
    {
        type            empty;
    }
    cylinder
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
