run/muck_q2d_FFT/constant/polyMesh/blockMeshDict
// blockMesh :  Block mesh description file
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// ************************************






// atencio Sd manifold trampejat

   meshGenApp blockMesh;
   convertToMeters 1.000;

    
    
        
    
    
        
    
       

   //******* channel coordinates and mesh ***********
   
          //******* mainfold ***********
   
      // 
      // 
    

            // l = left, mirant des del plasma
   
   
            // r = right, mirant des del plasma

             // u = up
             // d = down
   
   vertices
   (
    // INLET B11 **********************************************
    (0  0.9  0) // Vertex B11_i_l_d = 0 
    (0  0  0) // Vertex B11_i_r_d = 1 
    (0  0.9  0.02) // Vertex B11_i_l_u = 2 
    (0  0  0.02) // Vertex B11_i_r_u = 3 
    // OUTLET B11 *********************************************
    (1  0.9  0) // Vertex B11_o_l_d = 4 
    (1  0  0) // Vertex B11_o_r_d = 5 
    (1  0.9  0.02) // Vertex B11_o_l_u = 6 
    (1  0  0.02) // Vertex B11_o_r_u = 7 

    // INLET B12 **********************************************
    (0  1.1  0) // Vertex B12_i_l_d = 8 
//    (Xi  Ycr  Zd) vlabel(B12_i_r_d)
    (0  1.1  0.02) // Vertex B12_i_l_u = 9 
//    (Xi  Ycr  Zu) vlabel(B12_i_r_u)
    // OUTLET B12 *********************************************
    (1  1.1  0) // Vertex B12_o_l_d = 10 
//    (Xci  Ycr  Zd) vlabel(B12_o_r_d)
    (1  1.1  0.02) // Vertex B12_o_l_u = 11 
//    (Xci  Ycr  Zu) vlabel(B12_o_r_u)

    // INLET B13 **********************************************
    (0  2  0) // Vertex B13_i_l_d = 12 
//    (Xi  Ycl  Zd) vlabel(B13_i_r_d)
    (0  2  0.02) // Vertex B13_i_l_u = 13 
//    (Xi  Ycl  Zu) vlabel(B13_i_r_u)
    // OUTLET B13 *********************************************
    (1  2  0) // Vertex B13_o_l_d = 14 
//    (Xci  Ycl  Zd) vlabel(B13_o_r_d)
    (1  2  0.02) // Vertex B13_o_l_u = 15 
//    (Xci  Ycl  Zu) vlabel(B13_o_r_u)

//    // INLET B2 **********************************************
//    (Xci  Ycr  Zd) vlabel(B2_i_l_d)
//    (Xci  Yr   Zd) vlabel(B2_i_r_d)
//    (Xci  Ycr  Zu) vlabel(B2_i_l_u)
//    (Xci  Yr   Zu) vlabel(B2_i_r_u)
//
//    // OUTLET B2 **********************************************
//    (Xco  Ycr  Zd) vlabel(B2_o_l_d)
//    (Xco  Yr   Zd) vlabel(B2_o_r_d)
//    (Xco  Ycr  Zu) vlabel(B2_o_l_u)
//    (Xco  Yr   Zu) vlabel(B2_o_r_u)
//
//    // INLET B3 **********************************************
//    (Xci  Yl    Zd) vlabel(B3_i_l_d)
//    (Xci  Ycl   Zd) vlabel(B3_i_r_d)
//    (Xci  Yl    Zu) vlabel(B3_i_l_u)
//    (Xci  Ycl   Zu) vlabel(B3_i_r_u)
//
//    // OUTLET B3 **********************************************
//    (Xco  Yl    Zd) vlabel(B3_o_l_d)
//    (Xco  Ycl   Zd) vlabel(B3_o_r_d)
//    (Xco  Yl    Zu) vlabel(B3_o_l_u)
//    (Xco  Ycl   Zu) vlabel(B3_o_r_u)


    // INLET B41 **********************************************
    (1.2  0.9  0) // Vertex B41_i_l_d = 16 
    (1.2  0  0) // Vertex B41_i_r_d = 17 
    (1.2  0.9  0.02) // Vertex B41_i_l_u = 18 
    (1.2  0  0.02) // Vertex B41_i_r_u = 19 
    // OUTLET B41 *********************************************
    (4  0.9  0) // Vertex B41_o_l_d = 20 
    (4  0  0) // Vertex B41_o_r_d = 21 
    (4  0.9  0.02) // Vertex B41_o_l_u = 22 
    (4  0  0.02) // Vertex B41_o_r_u = 23     

    // INLET B42 **********************************************
    (1.2  1.1  0) // Vertex B42_i_l_d = 24 
//    (Xco  Ycr  Zd) vlabel(B42_i_r_d)
    (1.2  1.1  0.02) // Vertex B42_i_l_u = 25 
//    (Xco  Ycr  Zu) vlabel(B42_i_r_u)
    // OUTLET B42 *********************************************
    (4  1.1  0) // Vertex B42_o_l_d = 26 
//    (Xo  Ycr  Zd) vlabel(B42_o_r_d)
    (4  1.1  0.02) // Vertex B42_o_l_u = 27 
//    (Xo  Ycr  Zu) vlabel(B42_o_r_u)           
    
    // INLET B43 **********************************************
    (1.2  2  0) // Vertex B43_i_l_d = 28 
//    (Xco  Ycl  Zd) vlabel(B43_i_r_d)
    (1.2  2  0.02) // Vertex B43_i_l_u = 29 
//    (Xco  Ycl  Zu) vlabel(B43_i_r_u)
    // OUTLET B43 *********************************************
    (4  2  0) // Vertex B43_o_l_d = 30 
//    (Xo  Ycl  Zd) vlabel(B43_o_r_d)
    (4  2  0.02) // Vertex B43_o_l_u = 31 
//    (Xo  Ycl  Zu) vlabel(B43_o_r_u)        
       
   );				


   blocks
   (
    //*******************************************
    //*****************************************************************
	// B11
    hex (1 5 4 0 3 7 6 2)
    (50 36 1) simpleGrading ( 1 1 1 )
    // end block B11
    
	// B12
    hex (0 4 10 8 2 6 11 9)
    (50 8 1) simpleGrading ( 1 1 1 )
    // end block B12    

	// B13
    hex (8 10 14 12 9 11 15 13)
    (50 36 1) simpleGrading ( 1 1 1 )
    // end block B13    
    
    

//	// B2
//    hex (B2_i_r_d B2_o_r_d B2_o_l_d B2_i_l_d B2_i_r_u B2_o_r_u B2_o_l_u B2_i_l_u)
//    (NB2 NyB Nz) simpleGrading ( 1 1 1 )
//    // end block B2    
//
//	// B3
//    hex (B3_i_r_d B3_o_r_d B3_o_l_d B3_i_l_d B3_i_r_u B3_o_r_u B3_o_l_u B3_i_l_u)
//    (NB3 NyB Nz) simpleGrading ( 1 1 1 )
//    // end block B3   
//
///////////////////////////////
    // B2
    hex (5 17 16 4 7 19 18 6)
    (10 36 1) simpleGrading ( 1 1 1 )
    // end block B2    

	// B3
    hex (10 24 28 14 11 25 29 15)
    (10 36 1) simpleGrading ( 1 1 1 )
    // end block B3    
////////////////////////////////


	// B41
    hex (17 21 20 16 19 23 22 18)
    (140 36 1) simpleGrading ( 1 1 1 )
    // end block B41
    
	// B42
    hex (16 20 26 24 18 22 27 25)
    (140 8 1) simpleGrading ( 1 1 1 )
    // end block B42    

	// B43
    hex (24 26 30 28 25 27 31 29)
    (140 36 1) simpleGrading ( 1 1 1 )
    // end block B43  

   );       //end blocks


//   edges
//   (
//     // Xr *************************************
//     arc xr_r1u_r1t xr_r1u_r1b (Xr Yr1arcu Zr1arc0)
//     arc xr_r1u_r1b xr_r1d_r1b (Xr Yr1arc0 Zr1arcb)
//     arc xr_r1d_r1b xr_r1d_r1t (Xr Yr1arcd Zr1arc0)
//     arc xr_r1d_r1t xr_r1u_r1t (Xr Yr1arc0 Zr1arct)
//     );



   patches
   (
      patch xinlet 
      (
	(1   3    2    0)
    (0   2    9    8)   	
    (8   9    13    12)
      )

     patch xoutlet 
      (
	(21   23    22    20)
	(20   22    27    26)
	(26   27    31    30)		
      )

     patch sideWalls
      (
    (1   5    7    3)
    (5   17    19    7)	
    (17   21    23    19)	
    
    (12   13    15    14)
    (14   15    29    28)
    (28   29    31    30)		

    )

    empty hartmannWalls
    (
    (3   7    6    2)
    (2   6    11    9)
    (9   11    15    13)        
    (7   19    18    6)
    (11   25    29    15)
    (19   23    22    18)   
    (18   22    27    25)            
    (25   27    31    29)                     

    (1   0    4    5)
    (0   8    10    4)
    (8   12    14    10)
    (5    4     16     17)
    (10    14     28     24)
    (17   16    20    21)
    (16   24    26    20)
    (24   28    30    26)        
    )
    
        patch cylinder
        (
    (10   24   25      11)    
    (4   6    18    16)    
    (6   4    10    11)    
    (24   16    18    25)    
        )    




//        patch iil_inter
//        (
//    (B13_o_r_u   B13_o_r_d    B13_o_l_d    B13_o_l_u)    
//        )    
//        patch iol_inter
//        (
//    (B3_i_l_d   B3_i_r_d    B3_i_r_u    B3_i_l_u)    
//        )            
//        patch oil_inter
//        (
//    (B3_o_r_u   B3_o_r_d    B3_o_l_d    B3_o_l_u)    
//        )    
//        patch ool_inter
//        (
//    (B43_i_l_d   B43_i_r_d    B43_i_r_u    B43_i_l_u)    
//        )           
//    
//        patch iir_inter
//        (
//    (B11_o_r_u   B11_o_r_d    B11_o_l_d    B11_o_l_u)    
//        )    
//        patch ior_inter
//        (
//    (B2_i_l_d   B2_i_r_d    B2_i_r_u    B2_i_l_u)    
//        )            
//        patch oir_inter
//        (
//    (B2_o_r_u   B2_o_r_d    B2_o_l_d    B2_o_l_u)    
//        )    
//        patch oor_inter
//        (
//    (B41_i_l_d   B41_i_r_d    B41_i_r_u    B41_i_l_u)    
//        )       
//
//
//
//
//
//    
//        patch rri_inter
//        (
//    (B11_i_l_d   B11_i_l_u    B11_o_l_u    B11_o_l_d)    
//        )
//        patch rli_inter
//        (
//    (B12_i_r_d   B12_o_r_d   B12_o_r_u      B12_i_r_u)    
//        )    
//        patch lri_inter
//        (
//    (B12_i_l_d   B12_i_l_u    B12_o_l_u    B12_o_l_d)    
//        )
//        patch lli_inter
//        (
//    (B13_i_r_d   B13_o_r_d   B13_o_r_u      B13_i_r_u)    
//        )        
//        
//        patch rro_inter
//        (
//    (B41_i_l_d   B41_i_l_u    B41_o_l_u    B41_o_l_d)    
//        )
//        patch rlo_inter
//        (
//    (B42_i_r_d   B42_o_r_d   B42_o_r_u      B42_i_r_u)    
//        )    
//        patch lro_inter
//        (
//    (B42_i_l_d   B42_i_l_u    B42_o_l_u    B42_o_l_d)    
//        )
//        patch llo_inter
//        (
//    (B43_i_r_d   B43_o_r_d   B43_o_r_u      B43_i_r_u)    
//        )                
        
        
    
    
     
  );














