run/muck_q2d_FFT/constant/transportProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
transportModel  Newtonian;

rho0            rho0 [1 -3 0 0 0 0 0] 9838.6622;
nu              nu [0 2 -1 0 0 0 0] 2.186592e-7;		//REFINAT	e-7;
sigma           sigma [-1 -3 3 0 0 2 0] 789165.141408;


T0              T0 [0 0 0 1 0 0 0] 0.0;

Cp              Cp [0 2 -2 -1 0 0 0] 189;

k               k [1 1 -3 -1 0 0 0] 15.14;

beta            beta [0 0 0 -1 0 0 0] 0.00012;

a               a [0 1 0 0 0 0 0] 1;

b               b [0 1 0 0 0 0 0] 1;

q0              q0 [1 -1 -3 0 0 0 0] 0.0;

m               m [0 0 0 0 0 0 0 ] 1;

coord           2;  //X_axis:1, Y_axis:2, Z_axis:3

fd              false; // "true" for fully developet temp. averaging



Ubar            Ubar [0 1 -1 0 0 0 0] (0 0 0);



