run/muck_q2d_FFT/system/controlDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// libs            ("libOpenFOAM.so" "libfieldFunctionObjects.so" "libforces.so");

application 	Q2DmhdFoam; 

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         200000;

deltaT          10;

writeControl    adjustableRunTime;

writeInterval   10000; 

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression uncompressed;

timeFormat      general;

timePrecision   8;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.001;

epsSteady	1e-08;

ssCriteria      false;


functions
{

    FFT_probes
    {
        type            probes;
        functionObjectLibs ("libsampling.so");
        enabled         true;
		interpolationScheme cellPointFace;
        outputControl   outputTime;
        outputInterval  1;
        probeLocations
(
	
(1.2538910505836576 0.0038910505836575876 0.01)
(1.2616731517509727 0.0038910505836575876 0.01)
(1.2694552529182879 0.0038910505836575876 0.01)
(1.277237354085603 0.0038910505836575876 0.01)
(1.2850194552529182 0.0038910505836575876 0.01)
(1.2928015564202333 0.0038910505836575876 0.01)
(1.3005836575875485 0.0038910505836575876 0.01)
(1.3083657587548636 0.0038910505836575876 0.01)
(1.3161478599221788 0.0038910505836575876 0.01)
(1.323929961089494 0.0038910505836575876 0.01)
(1.331712062256809 0.0038910505836575876 0.01)
(1.3394941634241242 0.0038910505836575876 0.01)
(1.3472762645914393 0.0038910505836575876 0.01)
(1.3550583657587545 0.0038910505836575876 0.01)
(1.3628404669260696 0.0038910505836575876 0.01)
(1.3706225680933848 0.0038910505836575876 0.01)
(1.3784046692607 0.0038910505836575876 0.01)
(1.386186770428015 0.0038910505836575876 0.01)
(1.3939688715953302 0.0038910505836575876 0.01)
(1.4017509727626454 0.0038910505836575876 0.01)
(1.4095330739299605 0.0038910505836575876 0.01)
(1.4173151750972757 0.0038910505836575876 0.01)
(1.4250972762645908 0.0038910505836575876 0.01)
(1.432879377431906 0.0038910505836575876 0.01)
(1.4406614785992211 0.0038910505836575876 0.01)
(1.4484435797665363 0.0038910505836575876 0.01)
(1.4562256809338514 0.0038910505836575876 0.01)
(1.4640077821011666 0.0038910505836575876 0.01)
(1.4717898832684817 0.0038910505836575876 0.01)
(1.4795719844357968 0.0038910505836575876 0.01)
(1.487354085603112 0.0038910505836575876 0.01)
(1.4951361867704271 0.0038910505836575876 0.01)
(1.5029182879377423 0.0038910505836575876 0.01)
(1.5107003891050574 0.0038910505836575876 0.01)
(1.5184824902723726 0.0038910505836575876 0.01)
(1.5262645914396877 0.0038910505836575876 0.01)
(1.5340466926070029 0.0038910505836575876 0.01)
(1.541828793774318 0.0038910505836575876 0.01)
(1.5496108949416332 0.0038910505836575876 0.01)
(1.5573929961089483 0.0038910505836575876 0.01)
(1.5651750972762635 0.0038910505836575876 0.01)
(1.5729571984435786 0.0038910505836575876 0.01)
(1.5807392996108938 0.0038910505836575876 0.01)
(1.588521400778209 0.0038910505836575876 0.01)
(1.596303501945524 0.0038910505836575876 0.01)
(1.6040856031128392 0.0038910505836575876 0.01)
(1.6118677042801544 0.0038910505836575876 0.01)
(1.6196498054474695 0.0038910505836575876 0.01)
(1.6274319066147847 0.0038910505836575876 0.01)
(1.6352140077820998 0.0038910505836575876 0.01)
(1.642996108949415 0.0038910505836575876 0.01)
(1.65077821011673 0.0038910505836575876 0.01)
(1.6585603112840452 0.0038910505836575876 0.01)
(1.6663424124513604 0.0038910505836575876 0.01)
(1.6741245136186755 0.0038910505836575876 0.01)
(1.6819066147859907 0.0038910505836575876 0.01)
(1.6896887159533058 0.0038910505836575876 0.01)
(1.697470817120621 0.0038910505836575876 0.01)
(1.7052529182879361 0.0038910505836575876 0.01)
(1.7130350194552513 0.0038910505836575876 0.01)
(1.7208171206225664 0.0038910505836575876 0.01)
(1.7285992217898816 0.0038910505836575876 0.01)
(1.7363813229571967 0.0038910505836575876 0.01)
(1.7441634241245119 0.0038910505836575876 0.01)
(1.751945525291827 0.0038910505836575876 0.01)
(1.7597276264591422 0.0038910505836575876 0.01)
(1.7675097276264573 0.0038910505836575876 0.01)
(1.7752918287937725 0.0038910505836575876 0.01)
(1.7830739299610876 0.0038910505836575876 0.01)
(1.7908560311284027 0.0038910505836575876 0.01)
(1.798638132295718 0.0038910505836575876 0.01)
(1.806420233463033 0.0038910505836575876 0.01)
(1.8142023346303482 0.0038910505836575876 0.01)
(1.8219844357976633 0.0038910505836575876 0.01)
(1.8297665369649785 0.0038910505836575876 0.01)
(1.8375486381322936 0.0038910505836575876 0.01)
(1.8453307392996088 0.0038910505836575876 0.01)
(1.853112840466924 0.0038910505836575876 0.01)
(1.860894941634239 0.0038910505836575876 0.01)
(1.8686770428015542 0.0038910505836575876 0.01)
(1.8764591439688694 0.0038910505836575876 0.01)
(1.8842412451361845 0.0038910505836575876 0.01)
(1.8920233463034997 0.0038910505836575876 0.01)
(1.8998054474708148 0.0038910505836575876 0.01)
(1.90758754863813 0.0038910505836575876 0.01)
(1.915369649805445 0.0038910505836575876 0.01)
(1.9231517509727603 0.0038910505836575876 0.01)
(1.9309338521400754 0.0038910505836575876 0.01)
(1.9387159533073905 0.0038910505836575876 0.01)
(1.9464980544747057 0.0038910505836575876 0.01)
(1.9542801556420208 0.0038910505836575876 0.01)
(1.962062256809336 0.0038910505836575876 0.01)
(1.9698443579766511 0.0038910505836575876 0.01)
(1.9776264591439663 0.0038910505836575876 0.01)
(1.9854085603112814 0.0038910505836575876 0.01)
(1.9931906614785966 0.0038910505836575876 0.01)
(2.0009727626459117 0.0038910505836575876 0.01)
(2.008754863813227 0.0038910505836575876 0.01)
(2.016536964980542 0.0038910505836575876 0.01)
(2.024319066147857 0.0038910505836575876 0.01)
...
		        );
		
		fields
        (
			vorticity
			U
        );
	}
);